In [1]:
import seaborn as sns

ModuleNotFoundError: No module named 'seaborn'

In [2]:
pip install seaborn

Collecting seaborn
  Downloading seaborn-0.11.1-py3-none-any.whl (285 kB)
Requirement already satisfied: matplotlib>=2.2 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (3.4.2)
Note: you may need to restart the kernel to use updated packages.Requirement already satisfied: numpy>=1.15 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (1.20.3)
WARNING: You are using pip version 20.2.3; however, version 21.1.2 is available.
You should consider upgrading via the 'C:\Users\selo\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

Collecting scipy>=1.0
  Downloading scipy-1.6.3-cp39-cp39-win_amd64.whl (32.7 MB)
Requirement already satisfied: pandas>=0.23 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (1.2.4)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\selo\appdata\roaming\python\python39\site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: cycler>=0.10 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (8.2.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\selo\appdata\local\programs\python\python39\lib\site-packages (from pandas>=0.23->seaborn) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\selo\appdata\roaming\python\python39\site-packages (from python-dateutil>=2.7->matplotlib>=2.2->seaborn) (1.15.0)
Installing collected packages: scipy, seaborn
Successfully installed scipy-1.6.3 seaborn-0.11.1

In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as mat

In [6]:
df = sns.load_dataset("planets")
df.head(10)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009
5  Radial Velocity       1         185.840   4.80     76.39  2008
6  Radial Velocity       1        1773.400   4.64     18.15  2002
7  Radial Velocity       1         798.500    NaN     21.41  1996
8  Radial Velocity       1         993.300  10.30     73.10  2008
9  Radial Velocity       2         452.800   1.99     74.79  2010

In [7]:
df.info

<bound method DataFrame.info of                method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]>

In [8]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [10]:
df.shape

(1035, 6)

In [16]:
df["orbital_period"].min()

945

In [17]:
df["orbital_period"].idxmin() #index nosunu verir

945

In [14]:
df["orbital_period"].max()

730000.0

In [15]:
df["orbital_period"].std()

26014.728304062508

In [18]:
df.describe().T #satırları sütüun sütunları satır yapar

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [19]:
df.isnull().sum() #null sayısını tespit etmek için kullanılır

method              0
number              0
orbital_period     43
mass              522
distance          227
year                0
dtype: int64

In [20]:
df.dropna(how="all")

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [21]:
df.dropna(how="any")

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [22]:
df.corr() #korelasyon

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

In [23]:
df[["mass", "distance"]].corr() # iki değişken arasındaki korelasyon

              mass  distance
mass      1.000000  0.274082
distance  0.274082  1.000000

In [24]:
df["method"].value_counts()   #uniq değerlerin sayısı

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [ ]:
# Groupby

In [28]:
df.groupby("method")["orbital_period"].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [27]:
df.groupby("method")[["orbital_period"]].mean()

                               orbital_period
method
Astrometry                         631.180000
Eclipse Timing Variations         4751.644444
Imaging                         118247.737500
Microlensing                      3153.571429
Orbital Brightness Modulation        0.709307
Pulsar Timing                     7343.021201
Pulsation Timing Variations       1170.000000
Radial Velocity                    823.354680
Transit                             21.102073
Transit Timing Variations           79.783500

In [29]:
df.groupby("method")[["orbital_period"]].describe()

                              orbital_period                                \
                                       count           mean            std
method
Astrometry                               2.0     631.180000     544.217663
Eclipse Timing Variations                9.0    4751.644444    2499.130945
Imaging                                 12.0  118247.737500  213978.177277
Microlensing                             7.0    3153.571429    1113.166333
Orbital Brightness Modulation            3.0       0.709307       0.725493
Pulsar Timing                            5.0    7343.021201   16313.265573
Pulsation Timing Variations              1.0    1170.000000            NaN
Radial Velocity                        553.0     823.354680    1454.926210
Transit                                397.0      21.102073      46.185893
Transit Timing Variations                3.0      79.783500      71.599884

                                                                       \
                                       min          25%           50%
method
Astrometry                      246.360000   438.770000    631.180000
Eclipse Timing Variations      1916.250000  2900.000000   4343.500000
Imaging                        4639.150000  8343.900000  27500.000000
Microlensing                   1825.000000  2375.000000   3300.000000
Orbital Brightness Modulation     0.240104     0.291496      0.342887
Pulsar Timing                     0.090706    25.262000     66.541900
Pulsation Timing Variations    1170.000000  1170.000000   1170.000000
Radial Velocity                   0.736540    38.021000    360.200000
Transit                           0.355000     3.160630      5.714932
Transit Timing Variations        22.339500    39.675250     57.011000


                                        75%            max
method
Astrometry                       823.590000    1016.000000
Eclipse Timing Variations       5767.000000   10220.000000
Imaging                        94250.000000  730000.000000
Microlensing                    3550.000000    5100.000000
Orbital Brightness Modulation      0.943908       1.544929
Pulsar Timing                     98.211400   36525.000000
Pulsation Timing Variations     1170.000000    1170.000000
Radial Velocity                  982.000000   17337.500000
Transit                           16.145700     331.600590
Transit Timing Variations        108.505500     160.000000

In [30]:
df.year.unique()

array([2006, 2008, 2011, 2007, 2009, 2002, 1996, 2010, 2001, 1995, 2004,
       2012, 2013, 2005, 2000, 2003, 1997, 1999, 2014, 1998, 1989, 1992,
       1994], dtype=int64)

In [31]:
df.year.nunique()

23

In [35]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [37]:
df1.groupby("Company")[["Sales"]].mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [38]:
df1.groupby("Company")[["Sales"]].std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [39]:
df1.groupby('Company')[['Sales']].agg(['min','max'])

        Sales
          min  max
Company
FB        243  350
GOOG      120  200
MSFT      124  340

In [40]:
df1.groupby("Company")[["Sales"]].describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [41]:
df1.groupby("Company")[["Sales"]].describe().T["GOOG"]

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [42]:
df2 = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df2.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [43]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [45]:
df2["col2"].unique()

array([444, 555, 666], dtype=int64)

In [46]:
df2.col2.nunique()

3

In [47]:
df2

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
newdf = df2[(df2['col1']>2) & (df2["col2"] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [50]:
df2["col2"].sum()

2109

In [51]:
del df2["col1"]

In [52]:
df2

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [54]:
df2.columns

Index(['col2', 'col3'], dtype='object')

In [55]:
df2.index

RangeIndex(start=0, stop=4, step=1)

In [56]:
df2.sort_values(by = "col2")

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [57]:
df2.sort_values(by = "col2", ascending= False)

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

In [59]:
df3 = pd.DataFrame({'col1':[1, 2, 3, np.nan],
                   'col2':[np.nan, 555, 666, 444],
                   'col3':['abc', 'def', 'ghi', 'xyz']})
df3

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [61]:
df3.dropna(how = "any")

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [62]:
df3

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [63]:
df3.fillna("FILL") #Nan olan verilerin yerini doldurur

   col1   col2 col3
0   1.0   FILL  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3  FILL  444.0  xyz

In [64]:
df3["col2"].fillna(df3.col2.mean()) # col2 deki Nan ları aynı sütunun ortalaması ile doldur

0    555.0
1    555.0
2    666.0
3    444.0
Name: col2, dtype: float64

In [66]:
df3[["col2","col1"]].fillna(df3.col2.mean())

    col2   col1
0  555.0    1.0
1  555.0    2.0
2  666.0    3.0
3  444.0  555.0

In [ ]:
##Map & Replace

In [103]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

df1 = pd.DataFrame(data)
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [94]:
df1

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [90]:
my_map = {"GOOG":"GOO", "MSFT":"MIC", "FB": "FACE"}

In [95]:
df1["Company"] = df1["Company"].map(my_map)
df1

  Company   Person  Sales
0     GOO      Sam    200
1     GOO  Charlie    120
2     MIC      Amy    340
3     MIC  Vanessa    124
4    FACE     Carl    243
5    FACE    Sarah    350

In [104]:
df1["Sales"] = df1["Sales"].map(lambda x: x * 1000)
df1

  Company   Person   Sales
0    GOOG      Sam  200000
1    GOOG  Charlie  120000
2    MSFT      Amy  340000
3    MSFT  Vanessa  124000
4      FB     Carl  243000
5      FB    Sarah  350000

In [105]:
df1["Company"] = df1["Company"].replace(to_replace ="GOO", value ="GOOGLE")
df1

  Company   Person   Sales
0    GOOG      Sam  200000
1    GOOG  Charlie  120000
2    MSFT      Amy  340000
3    MSFT  Vanessa  124000
4      FB     Carl  243000
5      FB    Sarah  350000

In [106]:
df1["Sales"] = df1["Sales"].astype(str)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      object
dtypes: object(3)
memory usage: 272.0+ bytes

In [101]:
df1

  Company   Person   Sales
0  GOOGLE      Sam  200000
1  GOOGLE  Charlie  120000
2     MIC      Amy  340000
3     MIC  Vanessa  124000
4    FACE     Carl  243000
5    FACE    Sarah  350000

In [109]:
df1["Sales"] = df1["Sales"].astype(str)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      object
dtypes: object(3)
memory usage: 272.0+ bytes

In [99]:
df1["Sales"] = df1["Sales"].map(lambda x : x[:-3])
df1

TypeError: 'int' object is not subscriptable

In [107]:
df4 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [108]:
df4.groupby("groups").mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [110]:
df4.groupby("groups").mean().T

groups    A    B    C
var1     16   17   66
var2    181  182  651

In [111]:
df4.groupby("groups").aggregate([np.min, np.median, np.max])  #birden fazla değer görmek istediğimizde aggregate kullanılır

       var1             var2
       amin median amax amin median amax
groups
A        10     16   22  100    181  262
B        11     17   23  111    182  253
C        33     66   99  333    651  969

In [112]:
df4.groupby("groups").agg([np.min, np.median, np.max]).T  # agg olarak da kısa yazılabilir. T ile sütun satır yer değiştirdi

groups         A    B    C
var1 amin     10   11   33
     median   16   17   66
     amax     22   23   99
var2 amin    100  111  333
     median  181  182  651
     amax    262  253  969

In [115]:
df4.groupby("groups").agg({"var1": "min", "var2": "max"}) # farklı sütunlarda farklı değerler getirmek için

        var1  var2
groups
A         10   262
B         11   253
C         33   969

In [ ]:
##Apply

In [116]:
df4

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [117]:
df4.apply(np.sum)  # grup bazlı sütunları topladı

groups    ABCABC
var1         198
var2        2028
dtype: object

In [118]:
def clarus(x):
    return x * 2

In [119]:
df4["var1"].apply(clarus)

0     20
1     46
2     66
3     44
4     22
5    198
Name: var1, dtype: int64

In [ ]:
##TEKRAR

In [121]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
#cinsiyete göre urvive ortalaması

In [125]:
titanic.groupby(["sex"])["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [ ]:
#cinsiyet ve kompartman numarasına göre survived ortalaması

In [126]:
titanic.groupby(["sex", "class"])["survived"].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64